classes/bard.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-14 Fri 12:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bard</title>
<meta name="author" content="zfoteff" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/stylesheets/subclass-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Bard</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb24443b">1. Level-up</a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
[<a href="../dnd.html#ID-DND">Main Menu</a>] [<a href="classes.html#ID-campaign-classes">Character Selection</a>] [<a href="classes.html#ID-campaign-classes">Classes</a>]
</p>
</div>
<hr />
<p>
Support the rest of the party using your talents, or your &ldquo;talents&rdquo;. Uses unique class abilities and spells
</p>

<p>
To begin playing a Bard, first choose a subclass: [<a href="subclasses/actor.html#ID-6a8efa65-451d-4eac-a069-84661a0c69ab">Actor</a>, <a href="subclasses/muse.html#ID-067059f6-be3d-4994-86ca-d7d33a291a79">Muse</a>, <a href="subclasses/craftsman.html#ID-05331b42-b242-4866-a6e6-df9cdad306e7">Craftsman</a>, or <a href="subclasses/shaman.html#ID-d204c3f7-766c-465b-a958-ec7e8283ad0b">Shaman</a>]. These subclasses give you special traits that increase in power as you get stronger, and a few distinct advantages right out the gate. Your character also gains 1 talisman (consult with DM to learn what you get). Be sure you apply your level 1 bonuses from your subclass.
</p>

<p>
<span class="underline">Spell attack bonus</span>: PROF + INT
<span class="underline">Initial Health</span>: Roll 1d6 and add it to your base HP
</p>
<div id="outline-container-orgb24443b" class="outline-2">
<h2 id="orgb24443b"><span class="section-number-2">1.</span> Level-up</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Gain Life Force Manipulation. At any time, you may use your turn to deal 1d6 decay damage to an enemy or heal an ally for 1d6. This can only be used in combat, but you can use it once after combat to heal if necessary.</li>
<li>Subclass Feature. Gain 1d6 health.</li>
<li>Your Intelligence and Wisdom scores both increase by 1.</li>
<li>Gain Health Transfer. Twice per combat, you may transfer up to 10 health from yourself to an ally. Gain 2d6 health.</li>
<li>Your Charisma is increased by +1. Gain 1d6 health.</li>
<li>Life Force Manipulation’s strength increases to 1d10.</li>
<li>Gain Transmutation. Learn about one of the following damage types of your choosing (Ice, Fire, Radiance, Energy, Force, Psychic). Once per round of combat, during an ally’s turn, you can change their damage dealt into damage of this type and add an additional 1d6 of this damage type. Gain 1d6 health.</li>
<li>Your Strength and Constitution scores both increase by 1.</li>
<li>Gain Bard Buff. Once per combat, grant one of your allies one of the bard buffs for the rest of combat (see subclasses for a list).</li>
<li>Subclass Feature. Gain 1d6 health.</li>
<li>Life Force Manipulation’s strength increases to 2d8.</li>
<li>Health Transfer’s strength increases to 20 health. Gain 1d6 health.</li>
<li>Learn Upgraded Transmutation - gain one more damage type, and when applying transmutation, the damage increases to 2d6.</li>
<li>Gain +1 of Any. Gain 1d6 health.</li>
<li>Subclass Feature.</li>
<li>You may now use Bard Buff twice per combat. Gain 1d6 health.</li>
<li>Life Force Manipulation’s strength increases to 2d12.</li>
<li>Gain +1 of Any and an additional +1 of Any (must be a different Ability Score than the first +1). Gain 1d6 health.</li>
<li>Subclass Feature.</li>
<li>Multiclass</li>
</ol>
<hr />
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-05 Wed 00:00</p>
<p class="author">Author: zfoteff</p>
<p class="date">Created: 2023-07-14 Fri 12:26</p>
</div>
</body>
</html>
